tutorials/filmBoiling2D/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 21.9E6;

boundaryField
{
    up
    {
        type            calculated;
        value           $internalField;
    }
    "wall.*"
    {
        type            cyclic;
    }
    down
    {
        type            calculated;
        value           $internalField;
    }
    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
