tutorials/filmBoiling2D/system/FOs/FOfieldAverage
fieldAverage1
{
        type                fieldAverage;
        libs                (fieldFunctionObjects);
        writeControl        writeTime;

        fields
        (
            U
            {
                mean        on;
                prime2Mean  on;
                base        time;
            }
        );
}

