tutorials/filmBoiling2D/system/FOs/FOvelocityComponents
    components(U)
    {
        type            components;
        libs            ( fieldFunctionObjects );
        field           U;
//        executeControl  timeStep;
     writeControl            adjustableRunTime;
    writeInterval           0.01;
        fields          1 ( U );
    }

