tutorials/filmBoiling2D/system/FOs/FOwriteCellCentres
writeCellCentres
{
    // Mandatory entries
    type            writeCellCentres;
    libs            (fieldFunctionObjects);

    // Optional (inherited) entries
    enabled         true;
    log             true;
    writeControl    writeTime;
}
